In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.0.3'

In [3]:
serie = pd.Series([10,12,14])
serie

0    10
1    12
2    14
dtype: int64

In [4]:
serie.values

array([10, 12, 14], dtype=int64)

In [5]:
serie.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
serie[0:2]

0    10
1    12
dtype: int64

In [7]:
serie=pd.Series([10,20,30,40,50], index = ["a", "b", "c","d","e"])
serie

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [8]:
df_01 = pd.DataFrame()

In [9]:
df_01["Nombre"] = ["Francisco", "Alejandro", "Adelian", "Sol", "Juan"]
df_01

      Nombre
0  Francisco
1  Alejandro
2    Adelian
3        Sol
4       Juan

In [10]:
df_01["Edad"] = ["23", "50","50","10","15"]
df_01

      Nombre Edad
0  Francisco   23
1  Alejandro   50
2    Adelian   50
3        Sol   10
4       Juan   15

In [11]:
df_01["Notas"] = [10,9,8,7,6]
df_01

      Nombre Edad  Notas
0  Francisco   23     10
1  Alejandro   50      9
2    Adelian   50      8
3        Sol   10      7
4       Juan   15      6

In [12]:
#agregamos una fila
nueva_fila = pd.Series(["Grabriel", 35, 5], index =["Nombre", "Edad", "Nota"])
nueva_fila

Nombre    Grabriel
Edad            35
Nota             5
dtype: object

In [13]:
df_01

      Nombre Edad  Notas
0  Francisco   23     10
1  Alejandro   50      9
2    Adelian   50      8
3        Sol   10      7
4       Juan   15      6

In [14]:
df_01.shape

(5, 3)

In [31]:
df_01.describe()

           Notas
count   5.000000
mean    8.000000
std     1.581139
min     6.000000
25%     7.000000
50%     8.000000
75%     9.000000
max    10.000000

In [25]:
#calcule el promedio
promedio = df_01["Notas"].mean()
promedio

86.6

In [28]:
#Calcule el desvio st

desvio_std = df_01["Notas"].std()
desvio_std

1.5811388300841898

In [27]:
#Calcule la minima
data = {"Notas": [10,9,8,7,6]}
df_01 = pd.DataFrame(data)
minima = df_01["Notas"].min()
minima

6

In [23]:
#Calcule la mayor edad
data = {"Edad": ["23", "50","50","10","15"]}
df_01 = pd.DataFrame(data)
mayor_edad = df_01["Edad"].max()
mayor_edad

'50'

In [29]:
import pandas as pd


data = {"Notas": [10,9,8,7,6]}
df_01 = pd.DataFrame(data)

# standard 
desvio_std = df_01["Notas"].std()


print(desvio_std)

1.5811388300841898